Revit 2027 API
TagHeadAlignment Enumeration
 An enumerated type listing the tag-head alignment options supported by the Bending Detail.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TagHeadAlignment
Public Enumeration TagHeadAlignment
public enum class TagHeadAlignment
type TagHeadAlignment
Members
Member name | Value | Description
RebarShapeFamily | 0 |  The tag-head is aligned using the rebar shape family direction.
View | 1 |  The tag-head is aligned using the view.
See Also
Reference
Autodesk.Revit.DB Namespace